CSI API ETABS v1

# eMatType Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eMatType

    Public Enumeration eMatType

    Dim instance As eMatType

    public enum class eMatType

    type eMatType

Members

| Member name| Value| Description
---|---|---|---
| Steel| 1|
| Concrete| 2|
| NoDesign| 3|
| Aluminum| 4|
| ColdFormed| 5|
| Rebar| 6|
| Tendon| 7|
| Masonry| 8|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com